# Ex - GroupBy

In [4]:
import numpy as np
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

In [5]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv')
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     170 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

### Step 3. Assign it to a variable called drinks.

In [5]:
drinks = df

### Step 4. Which continent drinks more beer on average?

In [18]:
df.groupby('continent')['beer_servings'].mean().sort_values(ascending=False).to_frame()

           beer_servings
continent
EU            193.777778
SA            175.083333
OC             89.687500
AF             61.471698
AS             37.045455

           beer_servings
continent
EU            193.777778

### Step 5. For each continent print the statistics for wine consumption.

In [20]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [24]:
df.groupby('continent')['wine_servings'].describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### Step 6. Print the mean alcohol consumption per continent for every column

In [25]:
df.columns

Index(['country', 'beer_servings', 'spirit_servings', 'wine_servings',
       'total_litres_of_pure_alcohol', 'continent'],
      dtype='object')

In [34]:
df_mean = df.groupby('continent')[['beer_servings', 'spirit_servings', 'wine_servings']].mean()
df_mean

           beer_servings  spirit_servings  wine_servings
continent
AF             61.471698        16.339623      16.264151
AS             37.045455        60.840909       9.068182
EU            193.777778       132.555556     142.222222
OC             89.687500        58.437500      35.625000
SA            175.083333       114.750000      62.416667

In [42]:
col_suma = []
for index, row in df_mean.iterrows():
    suma = row.sum()
    col_suma.append(suma)

df_mean['mean_alcohol_consumption'] = col_suma
df_mean

,beer_servings,spirit_servings,wine_servings,mean_alcohol_consumption
continent,,,,
AF,61.471698,16.339623,16.264151,188.150943
AS,37.045455,60.840909,9.068182,213.909091
EU,193.777778,132.555556,142.222222,937.111111
OC,89.687500,58.437500,35.625000,367.500000
SA,175.083333,114.750000,62.416667,704.500000

### Step 7. Print the median alcohol consumption per continent for every column

In [51]:
df['total_alcohol_consumption'] = df['beer_servings'] + df['wine_servings'] + df['spirit_servings']
df.groupby('continent')['total_alcohol_consumption'].median()

continent
AF     49.0
AS     68.0
EU    541.0
OC     98.5
SA    383.0
Name: total_alcohol_consumption, dtype: float64

In [ ]:
#Solucion de Marcos
df.groupby('continent')[['beer_servings', 'spirit_servings', 'wine_servings', 'total_litres_of_pure_alcohol']].median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

           beer_servings  spirit_servings  wine_servings  \
continent
AF                  32.0              3.0            2.0
AS                  17.5             16.0            1.0
EU                 219.0            122.0          128.0
NCA                143.0            137.0           11.0
OC                  52.5             37.0            8.5
SA                 162.5            108.5           12.0

           total_litres_of_pure_alcohol
continent
AF                                 2.30
AS                                 1.20
EU                                10.00
NCA                                6.30
OC                                 1.75
SA                                 6.85

### Step 8. Print the mean, min and max values for spirit consumption per continent.

In [56]:
df.loc[:,'spirit_servings'].describe()

count    193.000000
mean      80.994819
std       88.284312
min        0.000000
25%        4.000000
50%       56.000000
75%      128.000000
max      438.000000
Name: spirit_servings, dtype: float64

In [57]:
df.groupby('continent')['spirit_servings'].describe()

           count        mean        std   min    25%    50%     75%    max
continent
AF          53.0   16.339623  28.102794   0.0   1.00    3.0   19.00  152.0
AS          44.0   60.840909  84.362160   0.0   1.00   16.0   98.00  326.0
EU          45.0  132.555556  77.589115   0.0  81.00  122.0  173.00  373.0
OC          16.0   58.437500  70.504817   0.0  18.00   37.0   65.25  254.0
SA          12.0  114.750000  77.077440  25.0  65.75  108.5  148.75  302.0

In [6]:
df.groupby('continent')[['spirit_servings']].agg(['min', 'max', 'mean'])

          spirit_servings
                      min  max        mean
continent
AF                      0  152   16.339623
AS                      0  326   60.840909
EU                      0  373  132.555556
OC                      0  254   58.437500
SA                     25  302  114.750000

          spirit_servings
                     mean min  max median
continent
AF              16.339623   0  152    3.0
AS              60.840909   0  326   16.0
EU             132.555556   0  373  122.0
NCA            165.739130  68  438  137.0
OC              58.437500   0  254   37.0
SA             114.750000  25  302  108.5